akramnemri/esp32-qemu-lab/src/main.c
#include <stdint.h>
#include "esp32_regs.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "gpio.h"
#include "uart.h"

#define QUICK_MS    200
#define LONG_MS     800
#define HOLD_MS     2000

static void delay_ms(uint32_t ms) {
    vTaskDelay(pdMS_TO_TICKS(ms));
}

static void blink_quick(void) {
    gpio_set(2);
    delay_ms(QUICK_MS);
    gpio_clear(2);
    delay_ms(QUICK_MS);
}

static void blink_long(void) {
    gpio_set(2);
    delay_ms(LONG_MS);
    gpio_clear(2);
    delay_ms(LONG_MS);
}

static void hold_steady(void) {
    gpio_set(2);
    delay_ms(HOLD_MS);
    gpio_clear(2);
    delay_ms(HOLD_MS);
}

void app_main(void) {
    gpio_init_output(2);

    uart_puts("\r\n=== ESP32 QEMU Bare-Metal ===\r\n");
    uart_puts("Pattern: 2 quick -> 2 long -> 2s on -> 2s off\r\n");
    uart_puts("================================\r\n\r\n");

    while (1) {
        uart_puts("CYCLE START\r\n");

        blink_quick();
        blink_quick();
        uart_puts(" 2 quick done\r\n");

        blink_long();
        blink_long();
        uart_puts(" 2 long done\r\n");

        hold_steady();
        uart_puts(" hold done\r\n\r\n");
    }
}